[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryTable.js:12:17
     },
     {
       Header: "Term",
-      accessor: "yyyyq",
+      accessor: "",
     },
     {
killedBy: GradeHistoryTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="GradeHistoryTable-cell-row-0-col-yyyyq"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/GradeHistory/GradeHistoryTable.js:14:5
       Header: "Term",
       accessor: "yyyyq",
     },
-    {
-      Header: "Course",
-      accessor: "course",
-    },
+    {},
     {
       Header: "Instructor",
killedBy: GradeHistoryTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryTable.js:15:15
       accessor: "yyyyq",
     },
     {
-      Header: "Course",
+      Header: "",
       accessor: "course",
     },
killedBy: GradeHistoryTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Course. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/GradeHistory/GradeHistoryTable.js:22:5
       Header: "Instructor",
       accessor: "instructor",
     },
-    {
-      Header: "Grade",
-      accessor: "grade",
-    },
+    {},
     {
       Header: "Count",
killedBy: GradeHistoryTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/GradeHistory/GradeHistoryTable.js:26:5
       Header: "Grade",
       accessor: "grade",
     },
-    {
-      Header: "Count",
-      accessor: "count",
-    },
+    {},
     {
       Header: "Subject Area",
killedBy: GradeHistoryTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryTable.js:28:17
     },
     {
       Header: "Count",
-      accessor: "count",
+      accessor: "",
     },
     {
killedBy: GradeHistoryTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="GradeHistoryTable-cell-row-0-col-count"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryTable.js:31:15
       accessor: "count",
     },
     {
-      Header: "Subject Area",
+      Header: "",
       accessor: "subjectArea",
     },
killedBy: GradeHistoryTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Subject Area. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/GradeHistory/GradeHistoryTable.js:32:17
     },
     {
       Header: "Subject Area",
-      accessor: "subjectArea",
+      accessor: "",
     },
     {
killedBy: GradeHistoryTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="GradeHistoryTable-cell-row-0-col-subjectArea"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
