[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.js:35:17
     },
     {
       Header: "Section",
-      accessor: "classSections[0].section",
+      accessor: "",
     },
     {
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSectionsTable-cell-row-0-col-classSections[0].section"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/components/PersonalSections/PersonalSectionsTable.js:43:17
     },
     {
       Header: "Enrolled",
-      accessor: (row) =>
-        convertToFraction(
-          row.classSections[0].enrolledTotal,
-          row.classSections[0].maxEnroll
-        ),
+      accessor: () => undefined,
       id: "enrolled",
     },
killedBy: UserTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  84/100
Received:

[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.js:62:11
     {
       Header: "Time",
       accessor: (row) => formatTime(row.classSections[0].timeLocations),
-      id: "time",
+      id: "",
     },
     {
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSectionsTable-cell-row-0-col-time"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.js:73:54
 
   const columnsWithDelete = [
     ...columns,
-    ButtonColumn("Delete", "danger", deleteCallback, "PersonalSectionsTable"),
+    ButtonColumn("Delete", "danger", deleteCallback, ""),
   ];
 
