[Survived] BlockStatement
src/main/utils/sectionUtils.js:8:47
   console.log(message);
   toast(message);
 }
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/courses/user",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 

[Survived] ObjectLiteral
src/main/utils/sectionUtils.js:9:10
   toast(message);
 }
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/courses/user",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
+  return {};
 }
 

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:29:11
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
       res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
-      if (index + 1 < timeLocationArray.length) {
+      if (index + 1 <= timeLocationArray.length) {
         res += `, `;
       }
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: LIB 1312. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArithmeticOperator
src/main/utils/sectionUtils.js:29:11
     let res = "";
     for (let index = 0; index < timeLocationArray.length; index++) {
       res += `${timeLocationArray[index].building} ${timeLocationArray[index].room}`;
-      if (index + 1 < timeLocationArray.length) {
+      if (index - 1 < timeLocationArray.length) {
         res += `, `;
       }
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: LIB 1312. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:70:11
         hhmmTohhmma(timeLocationArray[index].beginTime),
         hhmmTohhmma(timeLocationArray[index].endTime),
       );
-      if (index + 1 < timeLocationArray.length) {
+      if (index + 1 <= timeLocationArray.length) {
         res += `, `;
       }
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: 2:00 PM - 3:15 PM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:84:25
 export const formatInstructors = (instructorArray) => {
   try {
     let res = "";
-    for (let index = 0; index < instructorArray.length; index++) {
+    for (let index = 0; index >= instructorArray.length; index++) {
       res += `${instructorArray[index].instructor}`;
       if (index + 1 < instructorArray.length) {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  YUNG A S
Received:

[Killed] StringLiteral
src/main/utils/sectionUtils.js:87:16
     for (let index = 0; index < instructorArray.length; index++) {
       res += `${instructorArray[index].instructor}`;
       if (index + 1 < instructorArray.length) {
-        res += `, `;
+        res += ``;
       }
     }
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  DANESHAMOOZ J, KILGORE J D, YANG YIFAN
Received:
  DANESHAMOOZ JKILGORE J DYANG YIFAN

[Killed] MethodExpression
src/main/utils/sectionUtils.js:97:10
 };
 
 export const isSection = (en1) => {
-  return en1.substring(2) !== "00";
+  return en1 !== "00";
 };
 
killedBy: Section tests First dropdown is different than last dropdown
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SectionsTable-cell-row-1-col-enrolled"]

Here are the matching elements:

<td
  data-testid="SectionsTable-cell-row-1-col-enrolled"
  role="cell"
  style="background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:104:14
 export const formatStatus = (section) => {
   if (section.courseCancelled) {
     return "Cancelled";
-  } else if (section.classClosed === "Y") {
+  } else if (section.classClosed !== "Y") {
     return "Closed";
   } else if (section.enrolledTotal >= section.maxEnroll) {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Open
Received:
  Closed

[Killed] StringLiteral
src/main/utils/sectionUtils.js:114:3
 };
 
 export const formatInfoLink = (row) =>
-  `/coursedetails/${row.courseInfo.quarter}/${row.section.enrollCode}`;
+  ``;
 
 export const renderInfoLink = ({ cell: { value } }) => (
killedBy: Section tests Info link is correct
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
