[Survived] ArrayDeclaration
main/components/PersonalSections/PersonalSectionsTable.js:23:5
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
     { onSuccess: onDeleteSuccess },
-    [],
+    ["Stryker was here"],
   );
 
