[Killed] StringLiteral
src/main/utils/sectionUtils.js:11:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/courses/user",
+    url: "",
     method: "DELETE",
     params: {
killedBy: section utils tests cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {
