[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleSelector.js:17:30
   const [scheduleState, setScheduleState] = useState(schedule);
 
   useEffect(() => {
-    if (filteredSchedules && filteredSchedules.length > 0) {
+    if (filteredSchedules && filteredSchedules.length <= 0) {
       setSchedule(filteredSchedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:40:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {filteredSchedules &&
-          filteredSchedules
-           .map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {false}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the filtered schedule prop if quarters match
statusReason: TestingLibraryElementError: Unable to find an element with the display value: W24 Schedule 1.

<body>
  <div>
    <div>
      <label
        class="form-label"
      >

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:40:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {filteredSchedules &&
-          filteredSchedules
-           .map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {true}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the filtered schedule prop if quarters match
statusReason: TestingLibraryElementError: Unable to find an element with the display value: W24 Schedule 1.

<body>
  <div>
    <div>
      <label
        class="form-label"
      >

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalScheduleSelector.js:42:17
       >
         {filteredSchedules &&
           filteredSchedules
-           .map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+           .map(() => undefined)}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the filtered schedule prop if quarters match
statusReason: TestingLibraryElementError: Unable to find an element with the display value: W24 Schedule 1.

<body>
  <div>
    <div>
      <label
        class="form-label"
      >
