[Killed] BooleanLiteral
main/components/PersonalSchedules/AddToScheduleModal.js:11:46
 import {filterSchedulesByQuarter} from "../../utils/PersonalScheduleUtils";
 
 export default function AddToScheduleModal({ section, onAdd, quarter }) {
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
   const [selectedSchedule, setSelectedSchedule] = useState("");
 
killedBy: AddToScheduleModal renders without crashing
statusReason: Error: useHref() may be used only in the context of a <Router> component.

[Killed] StringLiteral
main/components/PersonalSchedules/AddToScheduleModal.js:12:60
 
 export default function AddToScheduleModal({ section, onAdd, quarter }) {
   const [showModal, setShowModal] = useState(false);
-  const [selectedSchedule, setSelectedSchedule] = useState("");
+  const [selectedSchedule, setSelectedSchedule] = useState("Stryker was here!");
 
   // Stryker disable all
killedBy: AddToScheduleModal calls onAdd with the correct schedule when save is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Stryker was here!", ""
Received: "Stryker was here!", "Stryker was here!"

Number of calls: 1
