[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:16:5
   const localSearchSchedule = localStorage.getItem(controlId);
 
   const [scheduleState, setScheduleState] = useState(
-    localSearchSchedule || schedule,
+    false,
   );
 
killedBy: PersonalScheduleSelector sets the initial schedule from local storage
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Q1 2022 Schedule 2.

<body>
  <div>
    <div>
      <label
        class="form-label"
        for="controlId"

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:16:5
   const localSearchSchedule = localStorage.getItem(controlId);
 
   const [scheduleState, setScheduleState] = useState(
-    localSearchSchedule || schedule,
+    true,
   );
 
killedBy: PersonalScheduleSelector sets the initial schedule from local storage
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Q1 2022 Schedule 2.

<body>
  <div>
    <div>
      <label
        class="form-label"
        for="controlId"

[Killed] LogicalOperator
main/components/PersonalSchedules/PersonalScheduleSelector.js:20:9
   );
 
   useEffect(() => {
-    if (filteredSchedules && filteredSchedules.length > 0) {
+    if (filteredSchedules || filteredSchedules.length > 0) {
       setSchedule(filteredSchedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:43:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {filteredSchedules &&
-            filteredSchedules.map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {false}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from local storage
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Q1 2022 Schedule 2.

<body>
  <div>
    <div>
      <label
        class="form-label"
        for="controlId"
