[Killed] BlockStatement
src/main/utils/PersonalScheduleUtils.js:19:62
 }
 
 // returns an array of schedules that match the given quarter
-export function filterSchedulesByQuarter(schedules, quarter) {
-  return schedules.filter((schedule) => schedule.quarter === quarter);
-}
+export function filterSchedulesByQuarter(schedules, quarter) {}
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div />
</body>

[Killed] MethodExpression
src/main/utils/PersonalScheduleUtils.js:20:10
 
 // returns an array of schedules that match the given quarter
 export function filterSchedulesByQuarter(schedules, quarter) {
-  return schedules.filter((schedule) => schedule.quarter === quarter);
+  return schedules;
 }
killedBy: PersonalScheduleForm tests Filter function works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 6

@@ -3,6 +3,12 @@
      "description": "test1",
      "id": "schedule1",
