[Killed] BlockStatement
main/components/Jobs/UpdateGradeHistoryJobForm.js:4:35
 import { Form, Button, Container, Row, Col } from "react-bootstrap";
 
 const UpdateGradeHistoryJobForm = ({ callback }) => {
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    console.log("Updating Grade History");
-    callback();
-  };
+  const handleSubmit = (event) => {};
 
   // Stryker disable all : Stryker is testing by changing the padding to 0. But this is simply a visual optimization as it makes it look better
killedBy: AdminJobsPage tests user can submit the update grade history job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
