[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:51:49
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateGradeDataJob = () => ({
-    url: `/api/jobs/launch/uploadGradeData`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateGradeDataJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit the update grade history job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:52:10
   });
 
   const objectToAxiosParamsUpdateGradeDataJob = () => ({
-    url: `/api/jobs/launch/uploadGradeData`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit the update grade history job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/uploadGradeData"
Received: ""

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:93:52
     updateCoursesByQuarterRangeJobMutation.mutate(data);
   };
 
-  const submitUpdateGradeDataJob = async (data) => {
-    updateGradeDataMutation.mutate(data);
-  };
+  const submitUpdateGradeDataJob = async (data) => {};
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit the update grade history job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
